In [2]:
#Working with datetime in Pandas DataFrame
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'date': ['3/10/2000', '3/11/2000', '3/12/2000'],
                  'value': [2,3,4]})

In [3]:
df

        date  value
0  3/10/2000      2
1  3/11/2000      3
2  3/12/2000      4

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      object
 1   value   3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [5]:
df['date']=pd.to_datetime(df['date'])

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    3 non-null      datetime64[ns]
 1   value   3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

In [20]:
df = pd.DataFrame({'date': ['2016-6-10 20:30:0', 
                            '2016-7-1 19:45:30', 
                            '2013-10-12 4:5:1'],
                   'value': [2, 3, 4]})
df['date'] = pd.to_datetime(df['date'], format="%Y-%d-%m %H:%M:%S")

In [21]:
df

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2013-12-10 04:05:01      4

In [22]:
df['date'] = pd.to_datetime(df['date'], format="%m-%d-%Y %H:%M:%S")

In [24]:
df.head()

                 date  value
0 2016-10-06 20:30:00      2
1 2016-01-07 19:45:30      3
2 2013-12-10 04:05:01      4

In [ ]:
#Speedup parsing with infer_datetime_format
df = pd.DataFrame({'date': ['3/11/2000', '3/12/2000', '3/13/2000'] * 100 })

In [18]:
df.head()

        date
0  3/11/2000
1  3/12/2000
2  3/13/2000
3  3/11/2000
4  3/12/2000

In [19]:
%timeit pd.to_datetime(df['date'], infer_datetime_format=True)

1.11 ms ± 48.9 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [ ]:
%timeit pd.to_datetime(df['date'], infer_datetime_format=False)

1.27 ms ± 160 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [32]:
###

In [33]:
###

   year  month  day
0  2018      5    8
1  2012      3   15

In [27]:
#Handle parsing error
df = pd.DataFrame({'date': ['3/10/2000', 'a/11/2000', '3/12/2000'],
                   'value': [2, 3, 4]})

In [28]:
df['date'] = pd.to_datetime(df['date'])

ParserError: Unknown string format: a/11/2000

In [29]:
#ignoring wrong format
df['date'] = pd.to_datetime(df['date'], errors='ignore')
df

        date  value
0  3/10/2000      2
1  a/11/2000      3
2  3/12/2000      4

In [30]:
#coercing wrong format
df['date'] = pd.to_datetime(df['date'], errors='coerce')
df

        date  value
0 2000-03-10      2
1        NaT      3
2 2000-03-12      4

In [34]:
#2. Assemble a datetime from multiple columns
df = pd.DataFrame({'year': [2018, 2012],
                   'month': [5, 3],
                   'day': [8, 15]})

In [35]:
df

   year  month  day
0  2018      5    8
1  2012      3   15

In [36]:
df['date'] = pd.to_datetime(df)
df

   year  month  day       date
0  2018      5    8 2018-05-08
1  2012      3   15 2012-03-15

In [37]:
df = pd.DataFrame({'name': ['Tom', 'Andy', 'Lucas'],
                 'DoB': ['08-05-1997', '04-28-1996', '12-16-1995']})
df

    name         DoB
0    Tom  08-05-1997
1   Andy  04-28-1996
2  Lucas  12-16-1995

In [42]:
df['DoB'] = pd.to_datetime(df['DoB'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DoB     3 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(1)
memory usage: 176.0+ bytes

In [43]:
df['year']=df['DoB'].dt.year
df['month']=df['DoB'].dt.month
df['day']=df['DoB'].dt.day
df

    name        DoB  year  month  day
0    Tom 1997-08-05  1997      8    5
1   Andy 1996-04-28  1996      4   28
2  Lucas 1995-12-16  1995     12   16

In [44]:
#4. Get the week of year, the day of week and leap year
df['week_of_year'] = df['DoB'].dt.week
df['day_of_week'] = df['DoB'].dt.dayofweek
df['is_leap_year'] = df['DoB'].dt.is_leap_year
df

    name        DoB  year  month  day  week_of_year  day_of_week  is_leap_year
0    Tom 1997-08-05  1997      8    5            32            1         False
1   Andy 1996-04-28  1996      4   28            17            6          True
2  Lucas 1995-12-16  1995     12   16            50            5         False

In [45]:
df['DoB'].dt.weekday

0    1
1    6
2    5
Name: DoB, dtype: int64

In [46]:
dw_mapping={
    0: 'Monday', 
    1: 'Tuesday', 
    2: 'Wednesday', 
    3: 'Thursday', 
    4: 'Friday',
    5: 'Saturday', 
    6: 'Sunday'
} 
df['day_of_week_name']=df['DoB'].dt.weekday.map(dw_mapping)
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday

In [48]:
#5. Get the age from the date of birth
pd.to_datetime('today').year - df['DoB'].dt.year

0    26
1    27
2    28
Name: DoB, dtype: int64

In [50]:
today = pd.to_datetime('today')
df['age'] = today.year - df['DoB'].dt.year
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,26
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,27
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,28

In [51]:
#Year difference
today = pd.to_datetime('today')
diff_y = today.year - df['DoB'].dt.year

# Haven't had birthday
b_md = df['DoB'].apply(lambda x: (x.month,x.day) )
no_birthday = b_md > (today.month,today.day)

df['age'] = diff_y - no_birthday
df

,name,DoB,year,month,day,week_of_year,day_of_week,is_leap_year,day_of_week_name,age
0,Tom,1997-08-05,1997,8,5,32,1,False,Tuesday,25
1,Andy,1996-04-28,1996,4,28,17,6,True,Sunday,27
2,Lucas,1995-12-16,1995,12,16,50,5,False,Saturday,27

In [52]:
no_birthday

0     True
1    False
2     True
Name: DoB, dtype: bool

In [7]:
#Improve performance by setting date column as the index
df = pd.read_csv('C:/Users/prana/OneDrive/Desktop/Data_engineering/city_sales.csv', parse_dates=['date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376433 entries, 0 to 376432
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    376433 non-null  datetime64[ns]
 1   num     376433 non-null  int64
 2   city    376433 non-null  object
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 8.6+ MB

In [8]:
df = df.set_index(['date'])
df

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[376433 rows x 2 columns]

In [11]:
df.loc['2018', 'num'].sum()

132127

In [13]:
df['2018'].groupby('city').sum()

           num
city
London  132127

In [14]:
df['2015':'2019']

                     num    city
date
2015-01-01 09:00:00    4  London
2015-01-01 09:01:00    4  London
2015-01-01 09:02:00    3  London
2015-01-01 09:03:00    3  London
2015-01-01 09:04:00    3  London
...                  ...     ...
2018-06-06 09:54:00    3  London
2018-06-06 09:55:00    3  London
2018-06-06 09:56:00    3  London
2018-06-06 09:57:00    3  London
2018-06-06 09:58:00    1  London

[376433 rows x 2 columns]

In [15]:
df['logic'] = df.index.month==2
df['logic']

date
2015-01-01 09:00:00    False
2015-01-01 09:01:00    False
2015-01-01 09:02:00    False
2015-01-01 09:03:00    False
2015-01-01 09:04:00    False
                       ...
2018-06-06 09:54:00    False
2018-06-06 09:55:00    False
2018-06-06 09:56:00    False
2018-06-06 09:57:00    False
2018-06-06 09:58:00    False
Name: logic, Length: 376433, dtype: bool

In [16]:
#WORKING WITH JSON
import json

In [18]:
jsondata = {
    'student':{
        'name': 'Pranav',
        'interest': 'Futball',
        'age':23 
    }
}

In [20]:
with open('data_file.json', 'w') as write_file:
    json.dump(jsondata, write_file)

In [24]:
with open("data_file.json", "r") as read_file:
    data=json.load(read_file)

In [25]:
type(data)

dict

In [26]:
data

{'student': {'name': 'Pranav', 'interest': 'Futball', 'age': 23}}

In [27]:
#json as pandas df
import pandas as pd

In [42]:
#json data = jd
jd = '''{"Index0":{"Courses": "Pandas","time": "3 hours"},
           "Index1":{"Courses": "Hadoop","time": "2 hours"},
           "Index2":{"Courses": "Spark","time": "5 hours"}
          }'''

In [43]:
df1 = pd.read_json(jd, orient = 'index')
df1

       Courses     time
Index0  Pandas  3 hours
Index1  Hadoop  2 hours
Index2   Spark  5 hours

In [36]:
print(df1)

       Courses     time
Index0  Pandas  3 hours
Index1  Hadoop  2 hours
Index2   Spark  5 hours

In [54]:
#dictionary to dataframe
df2 = pd.DataFrame.from_dict(jsondata, orient='index')
df2

           name interest  age
student  Pranav  Futball   23

In [64]:
print(df2)

           name interest  age
student  Pranav  Futball   23